roofhoonfire/latency-aware-target-control/firmware/stm32/target_control_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "protocol/target_command_codec.h"
#include "protocol/uart_frame.h"
#include "protocol/uart_frame_validator.h"
#include "control/target_state.h"
#include "control/steering_controller.h"
#include "actuator/sg90_mapper.h"
#include "platform/stm32_pwm_backend.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define CONTROL_TASK_PERIOD_MS   20U
#define TARGET_TIMEOUT_MS       400U
/*
 * TIM4 clock after prescaler:
 * 6.25 MHz / (4 + 1) = 1.25 MHz
 */
#define TIM4_COUNTER_FREQUENCY_HZ   1250000U
#define TIM4_MAX_PERIOD_COUNTS      65536U

/*
 * PROVISIONAL SG90 BRING-UP VALUES.
 *
 * These are NOT calibrated runtime requirements.
 */
#define SG90_PWM_PERIOD_US                  20000U
#define SG90_NEGATIVE_LIMIT_PULSE_US        1200U
#define SG90_CENTER_PULSE_US                1500U
#define SG90_POSITIVE_LIMIT_PULSE_US        1800U
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

/* Definitions for CommRxTask */
osThreadId_t CommRxTaskHandle;
const osThreadAttr_t CommRxTask_attributes = {
  .name = "CommRxTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for ControlTask */
osThreadId_t ControlTaskHandle;
const osThreadAttr_t ControlTask_attributes = {
  .name = "ControlTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for targetCommandQueue */
osMessageQueueId_t targetCommandQueueHandle;
const osMessageQueueAttr_t targetCommandQueue_attributes = {
  .name = "targetCommandQueue"
};
/* USER CODE BEGIN PV */

uint8_t rx_buffer[15] = {0};
volatile uint8_t rx_complete =0;

volatile UartFrameValidationResult frame_validation_result =
    UART_FRAME_ERROR_NULL;
TargetCommand received_command = {0};
volatile uint8_t target_command_ready = 0U;//0-> no valid target command, 1-> target command deserialize success

volatile uint8_t queue_send_success = 0U;
volatile uint8_t queue_receive_success = 0U;

TargetState queue_received_target = {0};

volatile uint8_t controller_init_success = 0U;
volatile uint8_t controller_target_update_success = 0U;

volatile uint32_t controller_now_ms = 0U;
volatile uint32_t controller_step_count = 0U;

volatile float desired_steering_deg = 0.0F;




//for time out debugging
volatile uint32_t last_target_update_ms_debug = 0U;

volatile uint8_t hold_before_timeout_seen = 0U;
volatile uint8_t timeout_neutral_seen = 0U;

//for PWM Debugging
volatile uint8_t pwm_backend_init_success = 0U;
volatile uint8_t pwm_backend_start_success = 0U;
volatile uint8_t sg90_map_success = 0U;
volatile uint8_t pwm_apply_success = 0U;

volatile uint32_t pwm_period_us_debug = 0U;
volatile uint32_t pwm_pulse_width_us_debug = 0U;
volatile uint32_t pwm_ccr2_debug = 0U;



/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM4_Init(void);
void StartCommRxTask(void *argument);
void StartControlTask(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM4_Init();
  /* USER CODE BEGIN 2 */


  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of targetCommandQueue */
  targetCommandQueueHandle = osMessageQueueNew (4, sizeof(TargetState), &targetCommandQueue_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of CommRxTask */
  CommRxTaskHandle = osThreadNew(StartCommRxTask, NULL, &CommRxTask_attributes);

