roofhoonfire/latency-aware-target-control/firmware/stm32/target_control_stm32/Core/Src/main.c
  /*Configure GPIO pins : G7_Pin B2_Pin */
  GPIO_InitStruct.Pin = G7_Pin|B2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : G3_Pin B4_Pin */
  GPIO_InitStruct.Pin = G3_Pin|B4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_LTDC;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : LD3_Pin LD4_Pin */
  GPIO_InitStruct.Pin = LD3_Pin|LD4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : SDCKE1_Pin SDNE1_Pin */
  GPIO_InitStruct.Pin = SDCKE1_Pin|SDNE1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF12_FMC;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartCommRxTask */
/**
  * @brief  Function implementing the CommRxTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartCommRxTask */
void StartCommRxTask(void *argument)
{
  /* USER CODE BEGIN 5 */

	  for (;;)
	  {
	      if (HAL_UART_Receive(
	              &huart1,
	              rx_buffer,
	              sizeof(rx_buffer),
	              HAL_MAX_DELAY) == HAL_OK)
	      {
	          rx_complete = 1U;

	          frame_validation_result =
	              uart_frame_validate_target_command(
	                  rx_buffer,
	                  sizeof(rx_buffer));

	          if (frame_validation_result == UART_FRAME_VALID)
	          {
	        	  if (target_command_deserialize(
	        	          &rx_buffer[UART_FRAME_PAYLOAD_OFFSET],
	        	          TARGET_COMMAND_WIRE_SIZE,
	        	          &received_command))
	        	  {
	        	      target_command_ready = 1U;

	        	      const TargetState target = {
	        	          .x_cm = received_command.target_x,
	        	          .y_cm = received_command.target_y
	        	      };

	        	      if (osMessageQueuePut(
	        	              targetCommandQueueHandle,
	        	              &target,
	        	              0U,
	        	              osWaitForever) == osOK)
	        	      {
	        	          queue_send_success = 1U;
	        	      }
	        	  }
	          }
	      }
	  }


  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartControlTask */
/**
* @brief Function implementing the ControlTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartControlTask */
void StartControlTask(void *argument)
{
  /* USER CODE BEGIN StartControlTask */

    TargetState target = {0};

    const SteeringControllerConfig controller_config = {
        .wheelbase_m = 2.8F,
        .deadband_deg = 1.0F,
        .steering_limit_deg = 30.0F,
        .target_timeout_ms = TARGET_TIMEOUT_MS
    };

    SteeringController controller = {0};

    if (!steering_controller_init(
            &controller,
            &controller_config))
    {
        controller_init_success = 0U;
        osThreadExit();
    }

    controller_init_success = 1U;

    /*
     * Provisional SG90 mapping.
     *
     * These pulse widths are bring-up fixtures only.
     * Final values will be replaced after physical calibration.
     */
    const Sg90MapperConfig sg90_config = {
        .steering_limit_deg = 30.0F,
        .period_us = SG90_PWM_PERIOD_US,
        .pulse_at_negative_limit_us =
            SG90_NEGATIVE_LIMIT_PULSE_US,
        .pulse_at_center_us =
            SG90_CENTER_PULSE_US,
        .pulse_at_positive_limit_us =
            SG90_POSITIVE_LIMIT_PULSE_US
    };

    Stm32PwmBackend pwm_backend = {0};

    if (!stm32_pwm_backend_init(
            &pwm_backend,
            &htim4,
            TIM_CHANNEL_2,
            TIM4_COUNTER_FREQUENCY_HZ,
            TIM4_MAX_PERIOD_COUNTS))
    {
        pwm_backend_init_success = 0U;
        osThreadExit();
    }

    pwm_backend_init_success = 1U;

    if (!stm32_pwm_backend_start(&pwm_backend))
    {
        pwm_backend_start_success = 0U;
        osThreadExit();
    }

    pwm_backend_start_success = 1U;

    uint32_t next_wake_tick =
        osKernelGetTickCount();

    for (;;)
    {
        while (osMessageQueueGet(
                   targetCommandQueueHandle,
                   &target,
                   NULL,
                   0U) == osOK)
        {
            queue_received_target = target;
            queue_receive_success = 1U;

            const uint32_t target_update_ms =
                osKernelGetTickCount();

            controller_target_update_success =
                steering_controller_update_target(
                    &controller,
                    &target,
                    target_update_ms)
                    ? 1U
                    : 0U;

            if (controller_target_update_success != 0U)
            {
                last_target_update_ms_debug =
                    target_update_ms;
            }
        }

        const uint32_t now_ms =
            osKernelGetTickCount();

        controller_now_ms = now_ms;

        desired_steering_deg =
            steering_controller_step(
                &controller,
                now_ms);

        ++controller_step_count;

        /*
         * Common steering semantics
         *          ↓
         * SG90-specific mapping
         */
        PwmCommand pwm_command = {0};

        sg90_map_success =
            sg90_mapper_map(
                &sg90_config,
                desired_steering_deg,
                &pwm_command)
                ? 1U
                : 0U;

        if (sg90_map_success != 0U)
        {
            pwm_period_us_debug =
                pwm_command.period_us;

            pwm_pulse_width_us_debug =
                pwm_command.pulse_width_us;

