roofhoonfire/latency-aware-target-control/firmware/stm32/target_control_stm32/Core/Src/main.c
            /*
             * Hardware-independent PwmCommand
             *          ↓
             * STM32 hardware backend
             */
            pwm_apply_success =
                stm32_pwm_backend_apply(
                    &pwm_backend,
                    &pwm_command)
                    ? 1U
                    : 0U;

            if (pwm_apply_success != 0U)
            {
                pwm_ccr2_debug =
                    __HAL_TIM_GET_COMPARE(
                        &htim4,
                        TIM_CHANNEL_2);
            }
        }
        else
        {
            pwm_apply_success = 0U;
        }

        /*
         * Existing timeout verification instrumentation.
         */
        if (last_target_update_ms_debug != 0U)
        {
            const uint32_t elapsed_since_target_ms =
                now_ms - last_target_update_ms_debug;

            if ((elapsed_since_target_ms > 0U) &&
                (elapsed_since_target_ms <
                 TARGET_TIMEOUT_MS) &&
                (desired_steering_deg != 0.0F))
            {
                hold_before_timeout_seen = 1U;
            }

            if ((elapsed_since_target_ms >=
                 TARGET_TIMEOUT_MS) &&
                (desired_steering_deg == 0.0F))
            {
                timeout_neutral_seen = 1U;
            }
        }

        next_wake_tick +=
            CONTROL_TASK_PERIOD_MS;

        osDelayUntil(next_wake_tick);
    }

  /* USER CODE END StartControlTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
